---
kind: property
id: P:Autodesk.Revit.DB.ProjectLocationSet.IsEmpty
source: html/17cbf830-1f40-fa6c-9096-a4ef9c09302a.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.